load.test.yml
config:
  target: "http://localhost:3003"
  # processor: "./loadTestData.js"
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 60
      arrivalRate: 5
      rampTo: 500
    - duration: 120
      arrivalRate: 500
  payload:
    path: "load.test.data.csv"
    fields:
      - "id"
scenarios:
  - name: "Get records"
    flow:
      # - function: getRandomId
      - get:
          url: "/products/{{ id }}"